Repository: NoelKi/Portfolio-Angular-17
Catalog: src/locale/messages.*.xlf
Languages: de

source: portrait
de: Porträt

source: CONTACT ME
de: KONTAKTIEREN SIE MICH

source: FRONTEND DEVELOPER
de: FRONTEND-ENTWICKLER

source: Contact Me
de: Kontaktieren Sie mich

source: arrow
de: Pfeil

source: Still not sure if I am the right person for your project? Contact me so I can reassure you. Let us work together.
de: Immer noch unsicher, ob ich die richtige Person für Ihr Projekt bin? Kontaktieren Sie mich, damit ich Ihnen Ihre Zweifel nehmen kann. Lassen Sie uns zusammenarbeiten.

source: letter
de: Brief

source: phone
de: Telefon

source: I've read the <a class="orange" href="#">privacy policy</a> and agree to the processing of my data as outlined.
de: Ich habe die <a class="orange" href="#">Datenschutzrichtlinie</a> gelesen und stimme der Verarbeitung meiner Daten gemäß den angegebenen Bedingungen zu.

source: aerospace engineering B.Sc.<br>frontend developer
de: Luft- und Raumfahrttechnik B.Sc.<br>Frontend-Entwickler

source: Legal Notice
de: Rechtlicher Hinweis

source: Imprint
de: Impressum

source: close
de: schließen

source: burger-menu
de: Burger-Menü

source: Why me
de: Warum ich

source: Projects
de: Projekte

source: Contact
de: Kontakt

source: Information according to § 5 DDG
de: Information gemäß § 5 DDG

source: <span>Represented by: </span><br> Kieran Noel Mai<br>
de: <span>Vertreten durch: </span><br> Kieran Noel Mai<br>

source: <span>Disclaimer of liability: </span><br><br><span>Liability for content </span><br><br> The content of our website has been created with the greatest care. However, we cannot guarantee the accuracy, completeness and up-to-dateness of the content. However, we cannot assume any liability for the completeness and topicality of the content. As a service provider we are liable according to § 7 Abs.1 DDG for own contents on these pages according to the general laws. According to §§ 8 to 10 DDG, however, we are not obliged as a service provider to monitor transmitted or stored third-party information or to investigate circumstances that indicate illegal activity. Obligations to remove or block the use of information in accordance with general legislation remain unaffected by this. remain unaffected by this. However, liability in this respect is only possible from the point in time at which we become knowledge of a specific infringement. As soon as we become aware of such infringements, we will remove such content immediately. we will remove such content immediately. <br><br><span>Copyright</span><br><br> The content and works created by the site operators on these pages are subject to German copyright law. copyright law. The reproduction, editing, distribution and any kind of utilisation outside the limits of copyright law limits of copyright law require the written consent of the respective author or creator. Downloads and copies of this site are only permitted for private, non-commercial use. Insofar as the content on this site was not created by the operator, the copyrights of third parties are respected. In particular, third-party content is labelled as such. Should you nevertheless become aware of a copyright infringement, please inform us accordingly. If we become aware of infringements, we will remove such content immediately. remove such content. <br><br><span>Data protection</span><br><br> It is generally possible to use our website without providing personal data. As far as on our Insofar as personal data (e.g. name, address or e-mail addresses) is collected on our website, this is always done on a voluntary basis. As far as possible, this is always done on a voluntary basis. This data will not be passed on to third parties without your express consent. This data will not be passed on to third parties without your express consent. We would like to point out that data transmission on the Internet (e.g. when communicating by e-mail) can have security gaps. Complete protection of data against access by third parties is not possible. possible.<br> The use of contact data published in the context of the imprint obligation by third parties for the transmission of of unsolicited advertising and information material is hereby expressly prohibited. We hereby object to this. The operators of this website expressly reserve the right to take legal action in the event of unsolicited the unsolicited sending of advertising information, such as spam mails.<br>
de: <span>Haftungsausschluss: </span><br><br><span>Haftung für Inhalte </span><br><br> Die Inhalte unserer Seiten wurden mit größter Sorgfalt erstellt. Für die Richtigkeit, Vollständigkeit und Aktualität der Inhalte können wir jedoch keine Gewähr übernehmen. Als Diensteanbieter sind wir gemäß § 7 Abs.1 DDG für eigene Inhalte auf diesen Seiten nach den allgemeinen Gesetzen verantwortlich. Nach §§ 8 bis 10 DDG sind wir als Diensteanbieter jedoch nicht verpflichtet, übermittelte oder gespeicherte fremde Informationen zu überwachen oder nach Umständen zu forschen, die auf eine rechtswidrige Tätigkeit hinweisen. Verpflichtungen zur Entfernung oder Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unberührt. Eine diesbezügliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung möglich. Bei Bekanntwerden von entsprechenden Rechtsverletzungen werden wir diese Inhalte umgehend entfernen.<br><br><span>Urheberrecht</span><br><br> Die durch die Seitenbetreiber erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. Die Vervielfältigung, Bearbeitung, Verbreitung und jede Art der Verwertung außerhalb der Grenzen des Urheberrechtes bedürfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. Downloads und Kopien dieser Seite sind nur für den privaten, nicht kommerziellen Gebrauch gestattet. Soweit die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. Insbesondere werden Inhalte Dritter als solche gekennzeichnet. Sollten Sie trotzdem auf eine Urheberrechtsverletzung aufmerksam werden, bitten wir um einen entsprechenden Hinweis. Bei Bekanntwerden von Rechtsverletzungen werden wir derartige Inhalte umgehend entfernen.<br><br><span>Datenschutz</span><br><br> Die Nutzung unserer Webseite ist in der Regel ohne Angabe personenbezogener Daten möglich. Soweit auf unseren Seiten personenbezogene Daten (beispielsweise Name, Anschrift oder E-Mail-Adressen) erhoben werden, erfolgt dies, soweit möglich, stets auf freiwilliger Basis. Diese Daten werden ohne Ihre ausdrückliche Zustimmung nicht an Dritte weitergegeben. Wir weisen darauf hin, dass die Datenübertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich.<br> Der Nutzung von im Rahmen der Impressumspflicht veröffentlichten Kontaktdaten durch Dritte zur Übersendung von nicht ausdrücklich angeforderter Werbung und Informationsmaterialien wird hiermit ausdrücklich widersprochen. Die Betreiber der Seiten behalten sich ausdrücklich rechtliche Schritte im Falle der unverlangten Zusendung von Werbeinformationen, etwa durch Spam-Mails, vor.<br>

source: Private Policy Information
de: Datenschutzrichtlinien Informationen

source: Person in charge
de: Verantwortliche Person

source: The controller within the meaning of the data protection laws, in particular the EU General Data Protection Regulation (GDPR), is:
de: Der Verantwortliche im Sinne der Datenschutzgesetze, insbesondere der EU-Datenschutz-Grundverordnung (DSGVO), ist:

source: Your data subject rights
de: Ihre Betroffenenrechte

source: In accordance with the EU General Data Protection Regulation (GDPR), you can use the contact details provided at any time to exercise the following rights:
de: Gemäß der EU-Datenschutz-Grundverordnung (DSGVO) können Sie die bereitgestellten Kontaktdaten jederzeit nutzen, um folgende Rechte auszuüben:

source: <li>Information about your data stored by us and its processing (Art. 15 GDPR),</li><li>Correction of incorrect personal data (Art. 16 GDPR),</li><li>Erasure of your data stored by us (Art. 17 GDPR),</li><li>Restriction of data processing if we are not yet permitted to erase your data due to legal obligations (Art. 18 GDPR),</li><li>Objection to the processing of your data by us (Art. 21 GDPR) and</li><li>Data portability if you have consented to data processing or have concluded a contract with us (Art. 20 GDPR).</li>
de: <li>Informationen über Ihre bei uns gespeicherten Daten und deren Verarbeitung (Art. 15 DSGVO),</li><li>Berichtigung unrichtiger personenbezogener Daten (Art. 16 DSGVO),</li><li>Löschung Ihrer bei uns gespeicherten Daten (Art. 17 DSGVO),</li><li>Einschränkung der Datenverarbeitung, sofern wir Ihre Daten aufgrund gesetzlicher Pflichten noch nicht löschen dürfen (Art. 18 DSGVO),</li><li>Widerspruch gegen die Verarbeitung Ihrer Daten durch uns (Art. 21 DSGVO) und</li><li>Datenübertragbarkeit, sofern Sie in die Datenverarbeitung eingewilligt haben oder einen Vertrag mit uns abgeschlossen haben (Art. 20 DSGVO).</li>

source: If you have given us your consent, you can revoke it at any time with effect for the future.
de: Wenn Sie uns Ihre Einwilligung gegeben haben, können Sie diese jederzeit mit Wirkung für die Zukunft widerrufen.

source: You can lodge a complaint with a supervisory authority at any time, e.g., with the competent authority in the federal state of your place of residence or with the authority responsible for us as the competent authority.
de: Sie können jederzeit eine Beschwerde bei einer Aufsichtsbehörde einreichen, z. B. bei der zuständigen Behörde im Bundesland Ihres Wohnsitzes oder bei der für uns zuständigen Behörde.

source: A list of supervisory authorities (for the non-public sector) with addresses can be found at <a href="https://www.bfdi.bund.de/DE/Infothek/Anschriften_Links/anschriften_links-node.html">www.bfdi.bund.de</a>.
de: Eine Liste der Aufsichtsbehörden (für den nichtöffentlichen Bereich) mit Adressen finden Sie unter <a href="https://www.bfdi.bund.de/DE/Infothek/Anschriften_Links/anschriften_links-node.html">www.bfdi.bund.de</a>.

source: Processing activities
de: Verarbeitungsaktivitäten

source: A contact form is available on our website, which can be used for electronic communication. If a user makes use of this option, the data entered in the input mask will be transmitted to us and stored.
de: Auf unserer Website steht ein Kontaktformular zur Verfügung, das für die elektronische Kommunikation genutzt werden kann. Wenn ein Nutzer diese Option in Anspruch nimmt, werden die in der Eingabemaske eingegebenen Daten an uns übermittelt und gespeichert.

source: The following data is also stored at the time the message is sent:
de: Folgende Daten werden auch zum Zeitpunkt des Versands der Nachricht gespeichert:

source: <li>Date and time of the enquiry</li>
de: <li>Datum und Uhrzeit der Anfrage</li>

source: You can contact us via the email addresses provided. In this case, the personal data transmitted with the email will be stored, including the date and time the email was sent, email address, IP addresses, and information about the servers involved in the email communication.
de: Sie können uns über die bereitgestellten E-Mail-Adressen kontaktieren. In diesem Fall werden die mit der E-Mail übermittelten personenbezogenen Daten gespeichert, einschließlich Datum und Uhrzeit des E-Mail-Versands, E-Mail-Adresse, IP-Adressen und Informationen über die an der E-Mail-Kommunikation beteiligten Server.

source: You can contact us via the telephone numbers provided. In this case, we collect log data containing your telephone number and the duration of the call.
de: Sie können uns über die angegebenen Telefonnummern kontaktieren. In diesem Fall erfassen wir Protokolldaten, die Ihre Telefonnummer und die Dauer des Anrufs enthalten.

source: Regardless of the type of communication selected, we collect the content of your enquiry. Your data will be stored for the purpose of personalized communication with you.
de: Unabhängig von der gewählten Kommunikationsart erfassen wir den Inhalt Ihrer Anfrage. Ihre Daten werden zum Zweck der personalisierten Kommunikation mit Ihnen gespeichert.

source: Legal foundation
de: Rechtsgrundlage

source: The data is processed on the basis of a legitimate interest (Art. 6 para. 1 lit. f GDPR).
de: Die Daten werden auf Grundlage eines berechtigten Interesses (Art. 6 Abs. 1 lit. f DSGVO) verarbeitet.

source: Our legitimate interest in processing your data is to enable an easy establishment of contact with you.
de: Unser berechtigtes Interesse an der Verarbeitung Ihrer Daten besteht darin, eine einfache Kontaktaufnahme mit Ihnen zu ermöglichen.

source: If you contact us to inquire about an offer, the data will be processed for the purpose of implementing pre-contractual measures (Art. 6 para. 1 lit. b GDPR).
de: Wenn Sie uns kontaktieren, um ein Angebot anzufragen, werden die Daten zum Zweck der Durchführung vorvertraglicher Maßnahmen verarbeitet (Art. 6 Abs. 1 lit. b DSGVO).

source: Recipient
de: Empfänger

source: Recipients of the data may be technical service providers who act as processors for the operation and maintenance of our website.
de: Empfänger der Daten können technische Dienstleister sein, die als Auftragsverarbeiter für den Betrieb und die Wartung unserer Website agieren.

source: Storage duration
de: Speicherdauer

source: Data will be deleted no later than twelve months after the contact has been processed.
de: Die Daten werden spätestens zwölf Monate nach der Bearbeitung des Kontakts gelöscht.

source: If there is a contractual relationship, we are subject to the statutory retention periods. These are generally 6 or 10 years for reasons of proper accounting and tax law requirements.
de: Sofern ein Vertragsverhältnis besteht, unterliegen wir den gesetzlichen Aufbewahrungsfristen. Diese betragen in der Regel 6 oder 10 Jahre aus Gründen der ordnungsgemäßen Buchführung und steuerrechtlicher Anforderungen.

source: Provision prescribed or required
de: Bereitstellung vorgeschrieben oder erforderlich

source: The provision of your personal data is voluntary. However, we can only process your enquiry if you provide us with the required data and the reason for the enquiry.
de: Die Bereitstellung Ihrer personenbezogenen Daten ist freiwillig. Wir können Ihre Anfrage jedoch nur bearbeiten, wenn Sie uns die erforderlichen Daten und den Grund der Anfrage mitteilen.

source: Objection
de: Widerspruch

source: Read the information about your right of objection according to Art. 21 GDPR below.
de: Lesen Sie unten die Informationen zu Ihrem Widerspruchsrecht gemäß Art. 21 DSGVO.

source: Information about your right of objection under Art. 21 GDPR
de: Informationen zu Ihrem Widerspruchsrecht gemäß Art. 21 DSGVO

source: Individual case-related right of objection
de: Individueller Fallbezogener Widerspruch

source: You have the right to object at any time, on grounds relating to your particular situation, to the processing of your personal data, which is carried out on the basis of Art. 6(1)(f) GDPR (data processing based on a balance of interests); this also applies to profiling based on these provisions in accordance with Art. 4(4) GDPR.
de: Sie haben das Recht, jederzeit aus Gründen, die sich aus Ihrer besonderen Situation ergeben, der Verarbeitung Ihrer personenbezogenen Daten, die auf der Grundlage von Art. 6 Abs. 1 lit. f DSGVO erfolgt (Datenverarbeitung aufgrund eines Interessenausgleichs), zu widersprechen; dies gilt auch für das auf diesen Bestimmungen basierende Profiling gemäß Art. 4 Nr. 4 DSGVO.

source: If you object, we will no longer process your personal data unless we can demonstrate compelling legitimate grounds for the processing which override your interests, rights, and freedoms, or the processing is for the establishment, exercise, or defense of legal claims.
de: Wenn Sie widersprechen, werden wir Ihre personenbezogenen Daten nicht mehr verarbeiten, es sei denn, wir können zwingende schutzwürdige Gründe für die Verarbeitung nachweisen, die Ihre Interessen, Rechte und Freiheiten überwiegen, oder die Verarbeitung dient der Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen.

source: Recipient of an objection
de: Empfänger eines Widerspruchs

source: Changes to our Privacy Policy
de: Änderungen unserer Datenschutzerklärung

source: We reserve the right to amend this privacy policy to ensure it always complies with the current legal requirements or to implement changes to our services in the privacy policy, such as when introducing new services. Your renewed visit will then be subject to the new privacy policy.
de: Wir behalten uns das Recht vor, diese Datenschutzerklärung zu ändern, um sicherzustellen, dass sie stets den aktuellen gesetzlichen Anforderungen entspricht oder um Änderungen an unseren Dienstleistungen in die Datenschutzerklärung aufzunehmen, z. B. bei der Einführung neuer Dienstleistungen. Ihr erneuter Besuch unterliegt dann der neuen Datenschutzerklärung.

source: Questions about data protection
de: Fragen zum Datenschutz

source: If you have any questions about data protection, please email us at the address mentioned above.
de: Wenn Sie Fragen zum Datenschutz haben, senden Sie uns bitte eine E-Mail an die oben genannte Adresse.

source: My Projects
de: Meine Projekte

source: Challenge <br> Me
de: Fordere <br> mich heraus

source: I am always happy to learn new technonogies,just tell me what you <br> need.
de: Ich freue mich immer, neue Technologien zu lernen, sagen Sie mir einfach, was Sie <br> brauchen.

source: Let's talk
de: Lassen Sie uns sprechen

source: project-demo
de: Projekt-Demo

source: Need a teamplayer ?
de: Teamplayer gefällig?

source: Need a teamplayer?
de: Brauchen Sie einen Teamplayer?

source: Here what my colleagues said about me
de: Hier ist, was meine Kollegen über mich gesagt haben

source: protraits
de: Porträts

source: Why me
de: Warum ich

source: I am motivated to continuously learn new technologies and develop myself. My ability to solve complex problems and my passion for programming make me a valuable member of your team.
de: Ich bin motiviert, kontinuierlich neue Technologien zu lernen und mich weiterzuentwickeln. Meine Fähigkeit, komplexe Probleme zu lösen, und meine Leidenschaft für Programmierung machen mich zu einem wertvollen Mitglied Ihres Teams.

source: I am
de: Ich bin

source: location
de: Standort

source: located in Berlin
de: in Berlin ansässig

source: located <br> in Berlin
de: ansässig <br> in Berlin

source: suitcase
de: Koffer

source: open to relocate
de: bereit umzuziehen

source: open to<br> relocate
de: bereit <br> umzuziehen

source: open to work remote
de: bereit für Remote-Arbeit

source: open to <br> work remote
de: bereit <br> für Remote-Arbeit
